In [3]:
import pandas as pd
import numpy as np

In [5]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [7]:
df1 = pd.DataFrame(data)

In [11]:
f1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [16]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada','pakistan'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003, 2021],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2, 3.4]}

In [17]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada', 'pakistan'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003, 2021],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2, 3.4]}

In [20]:
df2 = pd.DataFrame(data)

In [21]:
df2

      state  year  pop
0      Ohio  2000  1.5
1      Ohio  2001  1.7
2      Ohio  2002  3.6
3    Nevada  2001  2.4
4    Nevada  2002  2.9
5    Nevada  2003  3.2
6  pakistan  2021  3.4

In [22]:
df2.head(5)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [24]:
df2.head(10)

      state  year  pop
0      Ohio  2000  1.5
1      Ohio  2001  1.7
2      Ohio  2002  3.6
3    Nevada  2001  2.4
4    Nevada  2002  2.9
5    Nevada  2003  3.2
6  pakistan  2021  3.4

In [25]:
df2['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
6    2021
Name: year, dtype: int64

In [26]:
df2['state']

0        Ohio
1        Ohio
2        Ohio
3      Nevada
4      Nevada
5      Nevada
6    pakistan
Name: state, dtype: object